Revit 2020 API
LightingDevice Properties
The LightingDevice type exposes the following members.
Properties
Name | Description
AssignedElectricalSystems
Retrieves the electrical systems this electrical panel currently is assigned to.
 (Inherited from MEPModel.)
ConnectorManager
Retrieves the Connector Manager from this MEPModel.
 (Inherited from MEPModel.)
ElectricalSystems
Retrieves the electrical systems that are currently created using this MEPModel.
 (Inherited from MEPModel.)
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
See Also
LightingDevice Class
Autodesk.Revit.DB.Electrical Namespace